{
    "uuid": "0127a369-a186-55a5-bced-55942dcb5e9f",
    "title": "Expertise-Centric Prompting Framework for Financial Tabular Data Generation using Pre-trained Large Language Models",
    "conference_full": "Conference on Neural Information Processing Systems",
    "conference": "NeurIPS",
    "year": 2024,
    "volume": "TRL @ NeurIPS 2024 Oral",
    "bibtex": "@inproceedings{\nkim2024expertisecentric,\ntitle={Expertise-Centric Prompting Framework for Financial Tabular Data Generation using Pre-trained Large Language Models},\nauthor={Subin Kim and Jungmin Son and Minyoung Jung and Youngjun Kwak},\nbooktitle={NeurIPS 2024 Third Table Representation Learning Workshop},\nyear={2024},\nurl={https://openreview.net/forum?id=N3o3jF9H0G}\n}",
    "authors": [
        "Subin Kim",
        "Jungmin Son",
        "Minyoung Jung",
        "Youngjun Kwak"
    ],
    "pdf_url": "https://openreview.net/pdf/0582ce549d7b5da7f9d45adc4c35136bcfebeb09.pdf",
    "pdf_path": "data/dataset/airqa/papers/neurips2024/0127a369-a186-55a5-bced-55942dcb5e9f.pdf",
    "num_pages": 17,
    "abstract": "Access to financial tabular data is often restricted owing to strict regulations surrounding personal information. Despite the advanced generative capabilities of large language models (LLMs), methodologies for the effective creation or expansion of financial tabular datasets remains undeveloped. The complexity of attribute relationships and the diverse data ranges in financial services present significant challenges in processing and understanding these datasets. To address these issues, we propose an expertise-centric prompting framework for synthesizing realistic and accessible pseudo-financial data. This framework involves a collaboration between financial experts and LLMs, focusing on schema calibration and attribute constraints. Moreover, we introduce new metrics to evaluate the realism of these pseudo datasets. We validated the effectiveness of the proposed framework and metrics on both English and Korean datasets, encompassing card transactions, loan statements, and deposits and savings, utilizing pre-trained LLMs such as KoGPT, ClovaX, LLAMA 2-Chat, GPT-3.0, and ChatGPT-3.5/4.0.",
    "tldr": "The paper proposes an expertise-centric prompting framework  and evaluation metrics for synthesizing realistic and accessible pseudo-financial datasets.",
    "tags": [
        "Prompting framework",
        "Data generation",
        "Financial tabular data",
        "Expertise",
        "Large language models (LLMs)",
        "Multilingual data"
    ]
}