{
    "uuid": "02a67239-2a8a-5168-bfd4-d861a1d86675",
    "title": "Expression Sampler as a Dynamic Benchmark for Symbolic Regression",
    "conference_full": "Conference on Neural Information Processing Systems",
    "conference": "NeurIPS",
    "year": 2023,
    "volume": "NeurIPS2023-AI4Science Poster",
    "bibtex": "@inproceedings{\nmarinescu2023expression,\ntitle={Expression Sampler as a Dynamic Benchmark for Symbolic Regression},\nauthor={Ioana Marinescu and Younes Strittmatter and Chad Williams and Sebastian Musslick},\nbooktitle={NeurIPS 2023 AI for Science Workshop},\nyear={2023},\nurl={https://openreview.net/forum?id=i3PecpoiPG}\n}",
    "authors": [
        "Ioana Marinescu",
        "Younes Strittmatter",
        "Chad C Williams",
        "Sebastian Musslick"
    ],
    "pdf_url": "https://openreview.net/pdf/01c902166cedf8a51526f8a8277472c38b41aa44.pdf",
    "pdf_path": "data/dataset/airqa/papers/neurips2023/02a67239-2a8a-5168-bfd4-d861a1d86675.pdf",
    "num_pages": 17,
    "abstract": "Equation discovery, the problem of identifying mathematical expressions from data, has witnessed the emergence of symbolic regression (SR) techniques aided by benchmarking systems like SRbench. However, these systems are limited by their reliance on static expressions and datasets, which, in turn, provides limited insight into the circumstances under which SR algorithms perform well versus fail. To address this issue, we introduce an open-source method for generating comprehensive SR datasets via random sampling of mathematical expressions. This method enables dynamic expression sampling while controlling for various expression characteristics pertaining to expression complexity. The method also allows for using prior information about expression distributions, for example, to simulate expression distributions for a specific scientific domain. Using this dynamic benchmark, we demonstrate that the overall performance of established SR algorithms decreases with expression complexity and provide insight into which equation features are best recovered. Our results suggest that most SR algorithms overestimate the number of expression tree nodes and trigonometric functions and underestimate the number of input variables present in the ground truth.",
    "tldr": "Dynamic benchmarking improves symbolic regression by sampling diverse mathematical expressions.",
    "tags": [
        "symbolic regression",
        "benchmark",
        "dataset"
    ]
}