{
    "uuid": "0a682805-0d4b-5c26-99fa-f0274595c395",
    "title": "Benchmark of Machine Learning Force Fields for Semiconductor Simulations: Datasets, Metrics, and Comparative Analysis",
    "conference_full": "Conference on Neural Information Processing Systems",
    "conference": "NeurIPS",
    "year": 2023,
    "volume": "NeurIPS 2023 Datasets and Benchmarks Poster",
    "bibtex": "@inproceedings{\nkim2023benchmark,\ntitle={Benchmark of Machine Learning Force Fields for Semiconductor Simulations: Datasets, Metrics, and Comparative Analysis},\nauthor={Geonu Kim and Byunggook Na and Gunhee Kim and Hyuntae Cho and Seungjin Kang and Hee Sun Lee and Saerom Choi and Heejae Kim and Seungwon Lee and Yongdeok Kim},\nbooktitle={Thirty-seventh Conference on Neural Information Processing Systems Datasets and Benchmarks Track},\nyear={2023},\nurl={https://openreview.net/forum?id=hr9Bd1A9Un}\n}",
    "authors": [
        "Geonu Kim",
        "Byunggook Na",
        "Gunhee Kim",
        "Hyuntae Cho",
        "Seungjin Kang",
        "Hee Sun Lee",
        "Saerom Choi",
        "Heejae Kim",
        "Seungwon Lee",
        "Yongdeok Kim"
    ],
    "pdf_url": "https://openreview.net/pdf/f42c1f1a186603664e83f89b217d20850bb465f1.pdf",
    "pdf_path": "data/dataset/airqa/papers/neurips2023/0a682805-0d4b-5c26-99fa-f0274595c395.pdf",
    "num_pages": 43,
    "abstract": "As semiconductor devices become miniaturized and their structures become more complex, there is a growing need for large-scale atomic-level simulations as a less costly alternative to the trial-and-error approach during development.\nAlthough machine learning force fields (MLFFs) can meet the accuracy and scale requirements for such simulations, there are no open-access benchmarks for semiconductor materials.\nHence, this study presents a comprehensive benchmark suite that consists of two semiconductor material datasets and ten MLFF models with six evaluation metrics. \nWe select two important semiconductor thin-film materials silicon nitride and hafnium oxide, and generate their datasets using computationally expensive density functional theory simulations under various scenarios at a cost of 2.6k GPU days.\nAdditionally, we provide a variety of architectures as baselines: descriptor-based fully connected neural networks and graph neural networks with rotational invariant or equivariant features.\nWe assess not only the accuracy of energy and force predictions but also five additional simulation indicators to determine the practical applicability of MLFF models in molecular dynamics simulations.\nTo facilitate further research, our benchmark suite is available at https://github.com/SAITPublic/MLFF-Framework.",
    "tldr": "In this benchmark, we introduce two novel semiconductor datasets (SAMD23) and conduct a thorough performance evaluation of various MLFF models, considering energy and force errors as well as simulation-derived metrics",
    "tags": [
        "Machine Learning Force Field (MLFF)",
        "Semiconductor datasets",
        "MLFF Benchmark"
    ]
}