{
    "uuid": "0a7bb69e-e83a-56b7-80ca-cbad1621dde4",
    "title": "Complex Query Answering on Eventuality Knowledge Graph with Implicit Logical Constraints",
    "conference_full": "Conference on Neural Information Processing Systems",
    "conference": "NeurIPS",
    "year": 2023,
    "volume": "NeurIPS 2023 poster",
    "bibtex": "@inproceedings{\nbai2023complex,\ntitle={Complex Query Answering on Eventuality Knowledge Graph with Implicit Logical Constraints},\nauthor={Jiaxin Bai and Xin Liu and Weiqi Wang and Chen Luo and Yangqiu Song},\nbooktitle={Thirty-seventh Conference on Neural Information Processing Systems},\nyear={2023},\nurl={https://openreview.net/forum?id=qQnO1HLQHe}\n}",
    "authors": [
        "Jiaxin Bai",
        "Xin Liu",
        "Weiqi Wang",
        "Chen Luo",
        "Yangqiu Song"
    ],
    "pdf_url": "https://openreview.net/pdf/8648b8b031c5e4d218b85e78ad84e67aef3d1054.pdf",
    "pdf_path": "data/dataset/airqa/papers/neurips2023/0a7bb69e-e83a-56b7-80ca-cbad1621dde4.pdf",
    "num_pages": 20,
    "abstract": "Querying knowledge graphs (KGs) using deep learning approaches can naturally leverage the reasoning and generalization ability to learn to infer better answers. Traditional neural complex query answering (CQA) approaches mostly work on entity-centric KGs. However, in the real world, we also need to make logical inferences about events, states, and activities (i.e., eventualities or situations) to push learning systems from System I to System II, as proposed by Yoshua Bengio. Querying logically from an EVentuality-centric KG (EVKG) can naturally provide references to such kind of intuitive and logical inference. Thus, in this paper, we propose a new framework to leverage neural methods to answer complex logical queries based on an EVKG, which can satisfy not only traditional first-order logic constraints but also implicit logical constraints over eventualities concerning their occurrences and orders. For instance, if we know that *Food is bad* happens before *PersonX adds soy sauce*, then *PersonX adds soy sauce* is unlikely to be the cause of *Food is bad* due to implicit temporal constraint. To facilitate consistent reasoning on EVKGs, we propose Complex Eventuality Query Answering (CEQA), a more rigorous definition of CQA that considers the implicit logical constraints governing the temporal order and occurrence of eventualities. In this manner, we propose to leverage theorem provers for constructing benchmark datasets to ensure the answers satisfy implicit logical constraints. We also propose a Memory-Enhanced Query Encoding (MEQE) approach to significantly improve the performance of state-of-the-art neural query encoders on the CEQA task.",
    "tldr": "New framework for complex query answering on eventuality-centric knowledge graphs.",
    "tags": [
        "Knowledge Graph",
        "Complex Query Answering",
        "Eventuality Graph"
    ]
}