{
    "uuid": "0dc71539-30ec-52ba-bad0-0d031ea757b2",
    "title": "Dynamic Planning with a LLM",
    "conference_full": "Conference on Neural Information Processing Systems",
    "conference": "NeurIPS",
    "year": 2024,
    "volume": "LanGame Spotlight",
    "bibtex": "@inproceedings{\ndagan2024dynamic,\ntitle={Dynamic Planning with a {LLM}},\nauthor={Gautier Dagan and Frank Keller and Alex Lascarides},\nbooktitle={Language Gamification - NeurIPS 2024 Workshop},\nyear={2024},\nurl={https://openreview.net/forum?id=ewx2RFiEYR}\n}",
    "authors": [
        "Gautier Dagan",
        "Frank Keller",
        "Alex Lascarides"
    ],
    "pdf_url": "https://openreview.net/pdf/7685b817ef46937f8f8ae0842b43c64df7b09687.pdf",
    "pdf_path": "data/dataset/airqa/papers/neurips2024/0dc71539-30ec-52ba-bad0-0d031ea757b2.pdf",
    "num_pages": 14,
    "abstract": "While Large Language Models (LLMs) can solve many NLP tasks in zero-shot settings, applications involving embodied agents remain problematic. In particular, plans that require multi-step reasoning become difficult and too costly as the context window grows. Planning requires understanding the likely effects of actions and identifying whether the current environment satisfies the goal. While symbolic planners can often find optimal solutions quickly, their capacity to handle noisy observations and uncertainty is relatively rudimentary, severely limiting their practical use. In contrast, Large Language Models (LLMs) cope with noisy observations and high levels of uncertainty. This paper presents LLM Dynamic Planner (LLM-DP): a neuro-symbolic framework where an LLM works hand-in-hand with a traditional planner to solve an embodied task. Given action-descriptions, LLM-DP solves Alfworld more successfully and efficiently than a LLM-only ReAct baseline.",
    "tldr": "We combine large language models with symbolic planning to efficiently solve embodied tasks, outperforming LLM-only approaches like ReAct on Alfworld.",
    "tags": [
        "LLM",
        "neuro-symbolic",
        "embodied agents",
        "multi-step reasoning",
        "symbolic planning"
    ]
}