{
    "uuid": "0e3f6c92-099b-5343-a589-7095452ddf16",
    "title": "The ALCHEmist: Automated Labeling 500x CHEaper than LLM Data Annotators",
    "conference_full": "Conference on Neural Information Processing Systems",
    "conference": "NeurIPS",
    "year": 2024,
    "volume": "NeurIPS 2024 spotlight",
    "bibtex": "@inproceedings{\nhuang2024the,\ntitle={The {ALCHE}mist: Automated Labeling 500x {CHE}aper than {LLM} Data Annotators},\nauthor={Tzu-Heng Huang and Catherine Cao and Vaishnavi Bhargava and Frederic Sala},\nbooktitle={The Thirty-eighth Annual Conference on Neural Information Processing Systems},\nyear={2024},\nurl={https://openreview.net/forum?id=T0glCBw28a}\n}",
    "authors": [
        "Tzu-Heng Huang",
        "Catherine Cao",
        "Vaishnavi Bhargava",
        "Frederic Sala"
    ],
    "pdf_url": "https://openreview.net/pdf/53a3bb2ee078f274280d72c6694f12d99ca0d2ba.pdf",
    "pdf_path": "data/dataset/airqa/papers/neurips2024/0e3f6c92-099b-5343-a589-7095452ddf16.pdf",
    "num_pages": 25,
    "abstract": "Large pretrained models can be used as annotators, helping replace or augment crowdworkers and enabling distilling generalist models into smaller specialist models. Unfortunately, this comes at a cost: employing top-of-the-line models often requires paying thousands of dollars for API calls, while the resulting datasets are static and challenging to audit. To address these challenges, we propose a simple alternative: rather than directly querying labels from pretrained models, we task models to generate programs that can produce labels. These programs can be stored and applied locally, re-used and extended, and cost orders of magnitude less. Our system, $\\textbf{Alchemist}$, obtains comparable to or better performance than large language model-based annotation in a range of tasks for a fraction of the cost: on average, improvements amount to a $\\textbf{12.9}$% enhancement while the total labeling costs across all datasets are reduced by a factor of approximately $\\textbf{500}\\times$.",
    "tldr": "We propose an alternative program distillation approach to replace expensive annotation processes that require repetitive prompting for labels.",
    "tags": [
        "Automated Data Labeling; Code Generation; Weak Supervision"
    ]
}