{
    "uuid": "1496affd-ee29-52de-8179-42e0418c899e",
    "title": "GLM-130B: An Open Bilingual Pre-trained Model",
    "conference_full": "International Conference on Learning Representations",
    "conference": "ICLR",
    "year": 2023,
    "volume": "ICLR 2023 poster",
    "bibtex": "@inproceedings{\nzeng2023glmb,\ntitle={{GLM}-130B: An Open Bilingual Pre-trained Model},\nauthor={Aohan Zeng and Xiao Liu and Zhengxiao Du and Zihan Wang and Hanyu Lai and Ming Ding and Zhuoyi Yang and Yifan Xu and Wendi Zheng and Xiao Xia and Weng Lam Tam and Zixuan Ma and Yufei Xue and Jidong Zhai and Wenguang Chen and Zhiyuan Liu and Peng Zhang and Yuxiao Dong and Jie Tang},\nbooktitle={The Eleventh International Conference on Learning Representations },\nyear={2023},\nurl={https://openreview.net/forum?id=-Aw0rrrPUF}\n}",
    "authors": [
        "Aohan Zeng",
        "Xiao Liu",
        "Zhengxiao Du",
        "Zihan Wang",
        "Hanyu Lai",
        "Ming Ding",
        "Zhuoyi Yang",
        "Yifan Xu",
        "Wendi Zheng",
        "Xiao Xia",
        "Weng Lam Tam",
        "Zixuan Ma",
        "Yufei Xue",
        "Jidong Zhai",
        "Wenguang Chen",
        "Zhiyuan Liu",
        "Peng Zhang",
        "Yuxiao Dong",
        "Jie Tang"
    ],
    "pdf_url": "https://openreview.net/pdf/8b5b1ff47d47935e500a223aa3c138cb0755002f.pdf",
    "pdf_path": "data/dataset/airqa/papers/iclr2023/1496affd-ee29-52de-8179-42e0418c899e.pdf",
    "num_pages": 56,
    "abstract": "We introduce GLM-130B, a bilingual (English and Chinese) pre-trained language model with 130 billion parameters. It is an attempt to open-source a 100B-scale model as good as GPT-3 (davinci) and unveil how models of such a scale can be successfully pre-trained. Over the course of this effort, we face numerous unexpected technical and engineering challenges, particularly on loss spikes and divergence. In this paper, we introduce the pre-training process of GLM-130B including its design choices, training strategies for both efficiency and stability, and engineering efforts. The resultant GLM-130B model offers significant outperformance over GPT-3 175B on a wide range of popular English benchmarks while the performance advantage is not observed in OPT-175B and BLOOM-176B. It also consistently and significantly outperforms ERNIE TITAN 3.0 260B—the largest Chinese language model—across related benchmarks. Finally, we leverage a unique scaling property of GLM-130B to reach INT4 quantization with almost no performance loss, making it the first among 100B-scale models and more importantly, allowing its effective inference on 4×RTX 3090 (24G) or 8×RTX 2080 Ti (11G) GPUs, the most ever affordable GPUs required for using 100B-scale models. The GLM-130B model weights are publicly accessible and its code, training logs, related toolkit, and lessons learned are open-sourced at https://github.com/THUDM/GLM-130B/.",
    "tldr": "GLM-130B is a bilingual model outperforming GPT-3 with open-source resources.",
    "tags": [
        "bilingual language model",
        "pre-trained models",
        "English Chinese NLP",
        "model quantization",
        "open source AI"
    ]
}