{
    "uuid": "1bc55c7c-8d2d-5044-a29f-d192744fce84",
    "title": "Work-in-Progress: Using Symbolic Planning with Deep RL to Improve Learning",
    "conference_full": "Conference on Neural Information Processing Systems",
    "conference": "NeurIPS",
    "year": 2023,
    "volume": "GenPlan'23",
    "bibtex": "@inproceedings{\nyang2023workinprogress,\ntitle={Work-in-Progress: Using Symbolic Planning with Deep {RL} to Improve Learning},\nauthor={Tianpei Yang and Srijita Das and Christabel Wayllace and Matthew Taylor},\nbooktitle={NeurIPS 2023 Workshop on Generalization in Planning},\nyear={2023},\nurl={https://openreview.net/forum?id=mntDNQ5ujE}\n}",
    "authors": [
        "Tianpei Yang",
        "Srijita Das",
        "Christabel Wayllace",
        "Matthew Taylor"
    ],
    "pdf_url": "https://openreview.net/pdf/625ca1353c7c549443c6bed764fef0495ac5fe37.pdf",
    "pdf_path": "data/dataset/airqa/papers/neurips2023/1bc55c7c-8d2d-5044-a29f-d192744fce84.pdf",
    "num_pages": 8,
    "abstract": "Deep Reinforcement Learning (DRL) has achieved expressive success across a wide range of domains. However, it is still faced with the sample-inefficiency problem that requires massive training samples to learn the optimal policy. Furthermore, the trained policy is highly dependent on the training environment which limits the generalization. In this paper, we propose the Planner-guided RL (PRL) approach to explore how symbolic planning can help DRL in terms of efficiency and generalization. Our PRL is a two-level structure that incorporates any symbolic planner as the meta-controller to derive the subgoals. The low-level controller learns how to achieve the subgoals. We evaluate PRL on Montezuma's Revenge and results show that PRL outperforms previous hierarchical methods. The evaluation of generalization is a work in progress",
    "tldr": "PRL improves deep RL efficiency and generalization using symbolic planning.",
    "tags": [
        "Deep Reinforcement Learning",
        "Symbolic Planning",
        "Sample Efficiency",
        "Generalization",
        "Hierarchical Methods"
    ]
}