{
    "uuid": "236f9dfc-a8eb-5ed3-a11d-df5835802ab2",
    "title": "An Unforgeable Publicly Verifiable Watermark for Large Language Models",
    "conference_full": "International Conference on Learning Representations",
    "conference": "ICLR",
    "year": 2024,
    "volume": "ICLR 2024 poster",
    "bibtex": "@inproceedings{\nliu2024an,\ntitle={An Unforgeable Publicly Verifiable Watermark for Large Language Models},\nauthor={Aiwei Liu and Leyi Pan and Xuming Hu and Shuang Li and Lijie Wen and Irwin King and Philip S. Yu},\nbooktitle={The Twelfth International Conference on Learning Representations},\nyear={2024},\nurl={https://openreview.net/forum?id=gMLQwKDY3N}\n}",
    "authors": [
        "Aiwei Liu",
        "Leyi Pan",
        "Xuming Hu",
        "Shuang Li",
        "Lijie Wen",
        "Irwin King",
        "Philip S. Yu"
    ],
    "pdf_url": "https://openreview.net/pdf/f0f63e9f78b87c4b3592845e676ca53814583c19.pdf",
    "pdf_path": "data/dataset/airqa/papers/iclr2024/236f9dfc-a8eb-5ed3-a11d-df5835802ab2.pdf",
    "num_pages": 17,
    "abstract": "Recently, text watermarking algorithms for large language models (LLMs) have been proposed to mitigate the potential harms of text generated by LLMs, including fake news and copyright issues. However, current watermark detection algorithms require the secret key used in the watermark generation process, making them susceptible to security breaches and counterfeiting during public detection.\nTo address this limitation, we propose an unforgeable publicly verifiable watermark algorithm named UPV that uses two different neural networks for watermark generation and detection, instead of using the same key at both stages. Meanwhile, the token embedding parameters are shared between the generation and detection networks, which makes the detection network achieve a high accuracy very efficiently.\nExperiments demonstrate that our algorithm attains high detection accuracy and computational efficiency through neural networks. Subsequent analysis confirms the high complexity involved in forging the watermark from the detection network. Our code is available at https://github.com/THU-BPM/unforgeable_watermark",
    "tldr": "We propose the first unforgeable publicly verifiable watermark text watermarking algorithm for LLMs using separate networks for generation and detection, achieving high accuracy and security.",
    "tags": [
        "Watermark",
        "Large Language Models",
        "Model Security"
    ]
}