{
    "uuid": "2c803a9d-d383-58d9-b87c-4d27c53eafc6",
    "title": "MultiTabQA: Generating Tabular Answers for Multi-Table Question Answering",
    "conference_full": "Conference on Neural Information Processing Systems",
    "conference": "NeurIPS",
    "year": 2023,
    "volume": "TRL @ NeurIPS 2023 Oral",
    "bibtex": "@inproceedings{\npal2023multitabqa,\ntitle={MultiTab{QA}: Generating Tabular Answers for Multi-Table Question Answering},\nauthor={Vaishali Pal and Andrew Yates and Evangelos Kanoulas and Maarten Rijke},\nbooktitle={NeurIPS 2023 Second Table Representation Learning Workshop},\nyear={2023},\nurl={https://openreview.net/forum?id=zxaoBcdACd}\n}",
    "authors": [
        "Vaishali Pal",
        "Andrew Yates",
        "Evangelos Kanoulas",
        "Maarten Rijke"
    ],
    "pdf_url": "https://openreview.net/pdf/fb6727ed05d99e5bfe5696a510da94043dbe1543.pdf",
    "pdf_path": "data/dataset/airqa/papers/neurips2023/2c803a9d-d383-58d9-b87c-4d27c53eafc6.pdf",
    "num_pages": 11,
    "abstract": "Recent advances in tabular question answering (QA) with large language models are constrained in their coverage and only answer questions over a single table. However, real-world queries are complex in nature, often over multiple tables in a  relational database or web page. Single table questions do not involve common table operations such as set operations, Cartesian products (joins), or nested queries. Furthermore, multi-table operations often result in a tabular output, which necessitates table generation capabilities of tabular QA models. To fill this gap, we propose a new task of answering questions over multiple tables. Our model, MultiTabQA, not only answers questions over multiple tables, but also generalizes to generate tabular answers. To enable effective training, we build a pre-training dataset comprising of 132,645 SQL queries and tabular answers. Further, we evaluate the generated tables by introducing table-specific metrics of varying strictness assessing various levels of granularity of the table structure. MultiTabQA outperforms state-of-the-art single table QA models adapted to a multi-table QA setting by finetuning on three datasets: Spider, Atis and GeoQuery.",
    "tldr": "MultiTabQA answers complex questions across multiple tables and generates tabular results.",
    "tags": [
        "Table QA",
        "multiple tables",
        "table generation"
    ]
}