{
    "uuid": "2d89f467-4b56-59df-a146-38cc4bd1db14",
    "title": "RestoreAgent: Autonomous Image Restoration Agent via Multimodal Large Language Models",
    "conference_full": "Conference on Neural Information Processing Systems",
    "conference": "NeurIPS",
    "year": 2024,
    "volume": "NeurIPS 2024 poster",
    "bibtex": "@inproceedings{\nchen2024restoreagent,\ntitle={RestoreAgent: Autonomous Image Restoration Agent via Multimodal Large Language Models},\nauthor={Haoyu Chen and Wenbo Li and Jinjin Gu and Jingjing Ren and Sixiang Chen and Tian Ye and Renjing Pei and Kaiwen Zhou and Fenglong Song and Lei Zhu},\nbooktitle={The Thirty-eighth Annual Conference on Neural Information Processing Systems},\nyear={2024},\nurl={https://openreview.net/forum?id=xgP5ynlZWf}\n}",
    "authors": [
        "Haoyu Chen",
        "Wenbo Li",
        "Jinjin Gu",
        "Jingjing Ren",
        "Sixiang Chen",
        "Tian Ye",
        "Renjing Pei",
        "Kaiwen Zhou",
        "Fenglong Song",
        "Lei Zhu"
    ],
    "pdf_url": "https://openreview.net/pdf/a7abb52bb68d236e32bce92953c8abf4bfa5f495.pdf",
    "pdf_path": "data/dataset/airqa/papers/neurips2024/2d89f467-4b56-59df-a146-38cc4bd1db14.pdf",
    "num_pages": 24,
    "abstract": "Natural images captured by mobile devices often suffer from multiple types of degradation, such as noise, blur, and low light. Traditional image restoration methods require manual selection of specific tasks, algorithms, and execution sequences, which is time-consuming and may yield suboptimal results. All-in-one models, though capable of handling multiple tasks, typically support only a limited range and often produce overly smooth, low-fidelity outcomes due to their broad data distribution fitting. To address these challenges, we first define a new pipeline for restoring images with multiple degradations, and then introduce RestoreAgent, an intelligent image restoration system leveraging multimodal large language models. RestoreAgent autonomously assesses the type and extent of degradation in input images and performs restoration through (1) determining the appropriate restoration tasks, (2) optimizing the task sequence, (3) selecting the most suitable models, and (4) executing the restoration. Experimental results demonstrate the superior performance of RestoreAgent in handling complex degradation, surpassing human experts. Furthermore, the system’s modular design facilitates the fast integration of new tasks and models.",
    "tldr": "RestoreAgent autonomously restores degraded images using multimodal language models.",
    "tags": [
        "Image Restoration",
        "Low level vision",
        "Agent",
        "Multimodal Large Language Model"
    ]
}