{
    "uuid": "2dfeabc6-8ca4-50b0-aff7-6498db583fb7",
    "title": "Neural Audio Codec for Latent Music Representations",
    "conference_full": "Conference on Neural Information Processing Systems",
    "conference": "NeurIPS",
    "year": 2024,
    "volume": "Audio Imagination: NeurIPS 2024 Workshop",
    "bibtex": "@inproceedings{\nlanzend{\\\"o}rfer2024neural,\ntitle={Neural Audio Codec for Latent Music Representations},\nauthor={Luca A Lanzend{\\\"o}rfer and Florian Gr{\\\"o}tschla and Amir Dellali and Roger Wattenhofer},\nbooktitle={Audio Imagination: NeurIPS 2024 Workshop AI-Driven Speech, Music, and Sound Generation},\nyear={2024},\nurl={https://openreview.net/forum?id=vzrk9ACbIb}\n}",
    "authors": [
        "Luca A Lanzendörfer",
        "Florian Grötschla",
        "Amir Dellali",
        "Roger Wattenhofer"
    ],
    "pdf_url": "https://openreview.net/pdf/6fe1ac6ceb1a484e3b97958216b6f406145eb832.pdf",
    "pdf_path": "data/dataset/airqa/papers/neurips2024/2dfeabc6-8ca4-50b0-aff7-6498db583fb7.pdf",
    "num_pages": 7,
    "abstract": "Neural audio codecs have become increasingly important for audio compression and, more recently, for creating tokenized representations for various generative downstream tasks. Consequently, the performance of neural audio codecs plays a crucial role in many applications. In this work, we introduce DisCodec, a high-fidelity neural audio codec for compressing 44.1kHz music into discrete or continuous latent representations. DisCodec leverages ConvNeXt and attention layers, an affine re-parametrization of the code vectors, and an improved commitment loss for better alignment between codebooks and model embeddings. We study comparisons of DisCodec against existing codecs, perform a comprehensive ablation of the proposed architecture, and demonstrate its performance against state-of-the-art neural audio codecs. We make the DisCodec codebase and model checkpoints available at https://github.com/ETH-DISCO/discodec.",
    "tldr": "We introduce a high-fidelity neural audio codec for compressing 44.1kHz music into discrete or continuous latent representations.",
    "tags": [
        "neural audio codec",
        "residual vector quantization"
    ]
}