{
    "uuid": "2fefd8c8-5b6e-54d7-bf55-3496f2297c2c",
    "title": "LV-SEGFORMER: Towards More Accurate Leaf-Vein Segmentation with Transformer",
    "conference_full": "IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP)",
    "conference": "icassp",
    "year": 2024,
    "volume": "ICASSP session IVMSP: Image, Video & Multidimensional Signal Processing",
    "bibtex": "@inproceedings{DBLP:conf/icassp/Cai024,\n  author       = {Wanqiang Cai and\n                  Bin Wang},\n  title        = {{LV-SEGFORMER:} Towards More Accurate Leaf-Vein Segmentation with\n                  Transformer},\n  booktitle    = {{IEEE} International Conference on Acoustics, Speech and Signal Processing,\n                  {ICASSP} 2024, Seoul, Republic of Korea, April 14-19, 2024},\n  pages        = {4370--4374},\n  publisher    = {{IEEE}},\n  year         = {2024},\n  url          = {https://doi.org/10.1109/ICASSP48485.2024.10446629},\n  doi          = {10.1109/ICASSP48485.2024.10446629},\n  timestamp    = {Mon, 05 Aug 2024 15:27:25 +0200},\n  biburl       = {https://dblp.org/rec/conf/icassp/Cai024.bib},\n  bibsource    = {dblp computer science bibliography, https://dblp.org}\n}",
    "authors": [
        "Wanqiang Cai",
        "Bin Wang"
    ],
    "pdf_url": "https://doi.org/10.1109/ICASSP48485.2024.10446629",
    "pdf_path": "data/dataset/airqa/papers/icassp2024/2fefd8c8-5b6e-54d7-bf55-3496f2297c2c.pdf",
    "num_pages": 5,
    "abstract": "Segmenting vein from leaf images is challenging because of the strong expansibility, high connectivity and irregular distribution of vein patterns. Although several recent attempts have been made to apply CNNs to leaf vein segmentation, they are weak to capture global contexts of lower-order veins and fine-grained features about higher-order veins due to the continuous stacking of convolution and pooling operations. Inspired by the great successes of transformers on semantic image segmentation, we for the first time develop a novel transformer based model, named LV-SegFormer for leaf vein segmentation. The LV-SegFormer leverages the powerful global modeling capability of transformer to generate advanced representations. The multi-stage alignment module and the hybrid decoder are designed to incorporate contexts from different stages and recover fine-grained features for performance boosting. Extensive experiments are conducted on two challenging benchmark datasets and the results demonstrate that the proposed LV-SegFormer achieves higher performance over the state-of-the-arts.",
    "tldr": "LV-SegFormer improves leaf vein segmentation using transformer-based global modeling.",
    "tags": [
        "leaf vein segmentation",
        "transformer model",
        "semantic segmentation",
        "computer vision",
        "deep learning"
    ]
}