{
    "uuid": "30c390e3-630b-5592-a1be-2771d1aa15a9",
    "title": "Aspect-Category Enhanced Learning with a Neural Coherence Model for Implicit Sentiment Analysis",
    "conference_full": "The 2023 Conference on Empirical Methods in Natural Language Processing",
    "conference": "EMNLP",
    "year": 2023,
    "volume": "Findings of the Association for Computational Linguistics: EMNLP 2023",
    "bibtex": "@inproceedings{cui-etal-2023-aspect,\n    title = \"Aspect-Category Enhanced Learning with a Neural Coherence Model for Implicit Sentiment Analysis\",\n    author = \"Cui, Jin  and\n      Fukumoto, Fumiyo  and\n      Wang, Xinfeng  and\n      Suzuki, Yoshimi  and\n      Li, Jiyi  and\n      Kong, Wanzeng\",\n    editor = \"Bouamor, Houda  and\n      Pino, Juan  and\n      Bali, Kalika\",\n    booktitle = \"Findings of the Association for Computational Linguistics: EMNLP 2023\",\n    month = dec,\n    year = \"2023\",\n    address = \"Singapore\",\n    publisher = \"Association for Computational Linguistics\",\n    url = \"https://aclanthology.org/2023.findings-emnlp.759\",\n    doi = \"10.18653/v1/2023.findings-emnlp.759\",\n    pages = \"11345--11358\",\n    abstract = \"Aspect-based sentiment analysis (ABSA) has been widely studied since the explosive growth of social networking services. However, the recognition of implicit sentiments that do not contain obvious opinion words remains less explored. In this paper, we propose aspect-category enhanced learning with a neural coherence model (ELCoM). It captures document-level coherence by using contrastive learning, and sentence-level by a hypergraph to mine opinions from explicit sentences to aid implicit sentiment classification. To address the issue of sentences with different sentiment polarities in the same category, we perform cross-category enhancement to offset the impact of anomalous nodes in the hypergraph and obtain sentence representations with enhanced aspect-category. Extensive experiments on benchmark datasets show that the ELCoM achieves state-of-the-art performance. Our source codes and data are released at \\url{https://github.com/cuijin-23/ELCoM}.\",\n}\n",
    "authors": [
        "Jin Cui",
        "Fumiyo Fukumoto",
        "Xinfeng Wang",
        "Yoshimi Suzuki",
        "Jiyi Li",
        "Wanzeng Kong"
    ],
    "pdf_url": "https://aclanthology.org/2023.findings-emnlp.759.pdf",
    "pdf_path": "data/dataset/airqa/papers/emnlp2023/30c390e3-630b-5592-a1be-2771d1aa15a9.pdf",
    "num_pages": 14,
    "abstract": "Aspect-based sentiment analysis (ABSA) has been widely studied since the explosive growth of social networking services. However, the recognition of implicit sentiments that do not contain obvious opinion words remains less explored. In this paper, we propose aspect-category enhanced learning with a neural coherence model (ELCoM). It captures document-level coherence by using contrastive learning, and sentence-level by a hypergraph to mine opinions from explicit sentences to aid implicit sentiment classification. To address the issue of sentences with different sentiment polarities in the same category, we perform cross-category enhancement to offset the impact of anomalous nodes in the hypergraph and obtain sentence representations with enhanced aspect-category. Extensive experiments on benchmark datasets show that the ELCoM achieves state-of-the-art performance. Our source codes and data are released at https://github.com/cuijin-23/ELCoM.",
    "tldr": "ELCoM enhances implicit sentiment analysis using aspect-category and coherence models.",
    "tags": [
        "implicit sentiment analysis",
        "aspect-based sentiment analysis",
        "neural coherence model",
        "contrastive learning",
        "hypergraph representation"
    ]
}