{
    "uuid": "3aaa5bca-d686-5f64-b1ef-92d8b28fb733",
    "title": "BLM-s/lE: A structured dataset of English spray-load verb alternations for testing generalization in LLMs",
    "conference_full": "The 2023 Conference on Empirical Methods in Natural Language Processing",
    "conference": "EMNLP",
    "year": 2023,
    "volume": "Findings of the Association for Computational Linguistics: EMNLP 2023",
    "bibtex": "@inproceedings{samo-etal-2023-blm,\n    title = \"{BLM}-s/l{E}: A structured dataset of {E}nglish spray-load verb alternations for testing generalization in {LLM}s\",\n    author = \"Samo, Giuseppe  and\n      Nastase, Vivi  and\n      Jiang, Chunyang  and\n      Merlo, Paola\",\n    editor = \"Bouamor, Houda  and\n      Pino, Juan  and\n      Bali, Kalika\",\n    booktitle = \"Findings of the Association for Computational Linguistics: EMNLP 2023\",\n    month = dec,\n    year = \"2023\",\n    address = \"Singapore\",\n    publisher = \"Association for Computational Linguistics\",\n    url = \"https://aclanthology.org/2023.findings-emnlp.821\",\n    doi = \"10.18653/v1/2023.findings-emnlp.821\",\n    pages = \"12276--12287\",\n    abstract = \"Current NLP models appear to be achieving performance comparable to human capabilities on well-established benchmarks. New benchmarks are now necessary to test deeper layers of understanding of natural languages by these models. Blackbird{'}s Language Matrices are a recently developed framework that draws inspiration from tests of human analytic intelligence. The BLM task has revealed that successful performances in previously studied linguistic problems do not yet stem from a deep understanding of the generative factors that define these problems. In this study, we define a new BLM task for predicate-argument structure, and develop a structured dataset for its investigation, concentrating on the spray-load verb alternations in English, as a case study. The context sentences include one alternant from the spray-load alternation and the target sentence is the other alternant, to be chosen among a minimally contrastive and adversarial set of answers. We describe the generation process of the dataset and the reasoning behind the generating rules. The dataset aims to facilitate investigations into how verb information is encoded in sentence embeddings and how models generalize to the complex properties of argument structures. Benchmarking experiments conducted on the dataset and qualitative error analysis on the answer set reveal the inherent challenges associated with the problem even for current high-performing representations.\",\n}\n",
    "authors": [
        "Giuseppe Samo",
        "Vivi Nastase",
        "Chunyang Jiang",
        "Paola Merlo"
    ],
    "pdf_url": "https://aclanthology.org/2023.findings-emnlp.821.pdf",
    "pdf_path": "data/dataset/airqa/papers/emnlp2023/3aaa5bca-d686-5f64-b1ef-92d8b28fb733.pdf",
    "num_pages": 12,
    "abstract": "Current NLP models appear to be achieving performance comparable to human capabilities on well-established benchmarks. New benchmarks are now necessary to test deeper layers of understanding of natural languages by these models. Blackbird’s Language Matrices are a recently developed framework that draws inspiration from tests of human analytic intelligence. The BLM task has revealed that successful performances in previously studied linguistic problems do not yet stem from a deep understanding of the generative factors that define these problems. In this study, we define a new BLM task for predicate-argument structure, and develop a structured dataset for its investigation, concentrating on the spray-load verb alternations in English, as a case study. The context sentences include one alternant from the spray-load alternation and the target sentence is the other alternant, to be chosen among a minimally contrastive and adversarial set of answers. We describe the generation process of the dataset and the reasoning behind the generating rules. The dataset aims to facilitate investigations into how verb information is encoded in sentence embeddings and how models generalize to the complex properties of argument structures. Benchmarking experiments conducted on the dataset and qualitative error analysis on the answer set reveal the inherent challenges associated with the problem even for current high-performing representations.",
    "tldr": "A new dataset for studying English spray-load verb alternations in LLMs.",
    "tags": [
        "NLP",
        "dataset",
        "verb alternations",
        "language models",
        "predicate-argument structure"
    ]
}