{
    "uuid": "3d007608-c976-5f84-9235-80e865a993ed",
    "title": "OSLO: One-Shot Label-Only Membership Inference Attacks",
    "conference_full": "Conference on Neural Information Processing Systems",
    "conference": "NeurIPS",
    "year": 2024,
    "volume": "NeurIPS 2024 poster",
    "bibtex": "@inproceedings{\npeng2024oslo,\ntitle={{OSLO}: One-Shot Label-Only Membership Inference Attacks},\nauthor={Yuefeng Peng and Jaechul Roh and Subhransu Maji and Amir Houmansadr},\nbooktitle={The Thirty-eighth Annual Conference on Neural Information Processing Systems},\nyear={2024},\nurl={https://openreview.net/forum?id=ZJBBeyEAyX}\n}",
    "authors": [
        "Yuefeng Peng",
        "Jaechul Roh",
        "Subhransu Maji",
        "Amir Houmansadr"
    ],
    "pdf_url": "https://openreview.net/pdf/9fd3b4434a639fc69ae4bba2b397013f29cbf2df.pdf",
    "pdf_path": "data/dataset/airqa/papers/neurips2024/3d007608-c976-5f84-9235-80e865a993ed.pdf",
    "num_pages": 24,
    "abstract": "We introduce One-Shot Label-Only (OSLO) membership inference attacks (MIAs), which accurately infer a given sample's membership in a target model's training set with high precision using just a single query, where the target model only returns the predicted hard label. \n  This is in contrast to state-of-the-art label-only attacks which require $\\sim6000$ queries, yet get attack precisions lower than OSLO's.\n  OSLO leverages transfer-based black-box adversarial attacks. The core idea is that a member sample exhibits more resistance to adversarial perturbations than  a non-member. We compare OSLO against state-of-the-art label-only attacks and demonstrate that, despite requiring only one query, our method significantly outperforms previous attacks in terms of precision and true positive rate (TPR) under the same false positive rates (FPR). For example, compared to previous label-only MIAs, OSLO achieves a TPR that is at least 7$\\times$ higher under a 1\\% FPR and at least 22$\\times$ higher under a 0.1\\% FPR on CIFAR100 for a ResNet18 model. We evaluated multiple defense mechanisms against OSLO.",
    "tldr": "We propose a label-only Membership Inference Attack (MIA) that works by sending only a single shot to the target model.",
    "tags": [
        "membership inference attack",
        "privacy",
        "leakage"
    ]
}