{
    "uuid": "52aecac0-4df1-5705-bda1-ffc236794071",
    "title": "Attacking LLM Watermarks by Exploiting Their Strengths",
    "conference_full": "International Conference on Learning Representations",
    "conference": "ICLR",
    "year": 2024,
    "volume": "SeT LLM @ ICLR 2024",
    "bibtex": "@inproceedings{\npang2024attacking,\ntitle={Attacking {LLM} Watermarks by Exploiting Their Strengths},\nauthor={Qi Pang and Shengyuan Hu and Wenting Zheng and Virginia Smith},\nbooktitle={ICLR 2024 Workshop on Secure and Trustworthy Large Language Models},\nyear={2024},\nurl={https://openreview.net/forum?id=P2FFPRxr3Q}\n}",
    "authors": [
        "Qi Pang",
        "Shengyuan Hu",
        "Wenting Zheng",
        "Virginia Smith"
    ],
    "pdf_url": "https://openreview.net/pdf/4c122def8e99bed6f0953b91fba90fc94c3c6aa5.pdf",
    "pdf_path": "data/dataset/airqa/papers/iclr2024/52aecac0-4df1-5705-bda1-ffc236794071.pdf",
    "num_pages": 21,
    "abstract": "Advances in generative models have made it possible for AI-generated text, code, and images to mirror human-generated content in many applications. Watermarking, a technique that aims to embed information in the output of a model to verify its source, is useful for mitigating misuse of such AI-generated content. However, existing watermarking schemes remain surprisingly susceptible to attack. In particular, we show that desirable properties shared by existing LLM watermarking systems such as quality preservation, robustness, and public detection APIs can in turn make these systems vulnerable to various attacks. We rigorously study potential attacks in terms of common watermark design choices, and propose best practices and defenses for mitigation---establishing a set of practical guidelines for embedding and detection of LLM watermarks.",
    "tldr": "We reveal and evaluate new attack vectors that exploit the common properties of LLM watermarks.",
    "tags": [
        "watermarking",
        "large language models",
        "security",
        "privacy-preserving machine learning"
    ]
}