{
    "uuid": "783e3f34-8657-5aab-991c-f990560cb693",
    "title": "Beyond Uniform Scaling: Exploring Depth Heterogeneity in Neural Architectures",
    "conference_full": "International Conference on Learning Representations",
    "conference": "ICLR",
    "year": 2024,
    "volume": "Tiny Papers @ ICLR 2024 Present",
    "bibtex": "@inproceedings{\nr.t2024beyond,\ntitle={Beyond Uniform Scaling: Exploring Depth Heterogeneity in Neural Architectures},\nauthor={Akash Guna R.T and Arnav Chavan and Deepak Gupta},\nbooktitle={The Second Tiny Papers Track at ICLR 2024},\nyear={2024},\nurl={https://openreview.net/forum?id=mURVIdmojf}\n}",
    "authors": [
        "Akash Guna R.T",
        "Arnav Chavan",
        "Deepak Gupta"
    ],
    "pdf_url": "https://openreview.net/pdf/d6e3dd8c49deed8f7b460bef062db47db5f27fff.pdf",
    "pdf_path": "data/dataset/airqa/papers/iclr2024/783e3f34-8657-5aab-991c-f990560cb693.pdf",
    "num_pages": 7,
    "abstract": "Conventional scaling of neural networks typically involves designing a base network and growing different dimensions like width, depth, etc. of the same by some predefined scaling factors. We introduce an automated scaling approach leveraging second-order loss landscape information. Our method is flexible towards skip connections a mainstay in modern vision transformers. Our training-aware method jointly scales and trains transformers without additional training iterations. Motivated by the hypothesis that not all neurons need uniform depth complexity, our approach embraces depth heterogeneity. Extensive evaluations on DeiT-S with ImageNet100 show a 2.5% accuracy gain and 10% parameter efficiency improvement over conventional scaling. Scaled networks demonstrate superior performance upon training small scale datasets from scratch. We introduce the first intact scaling mechanism for vision transformers, a step towards efficient model scaling.",
    "tldr": "We introduce a neural network scaling technique that is applicable to scale the depth of transformers at the neuron level.",
    "tags": [
        "Scaling Neural Networks",
        "Vision Transformers"
    ]
}