{
    "uuid": "7bc08302-bd44-5dfa-9e04-d6c4d8ce8b06",
    "title": "SAMO: Speaker Attractor Multi-Center One-Class Learning For Voice Anti-Spoofing",
    "conference_full": "IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP)",
    "conference": "icassp",
    "year": 2023,
    "volume": "ICASSP session SLT: Spoken Language Technology",
    "bibtex": "@inproceedings{DBLP:conf/icassp/DingZD23,\n  author       = {Siwen Ding and\n                  You Zhang and\n                  Zhiyao Duan},\n  title        = {{SAMO:} Speaker Attractor Multi-Center One-Class Learning For Voice\n                  Anti-Spoofing},\n  booktitle    = {{IEEE} International Conference on Acoustics, Speech and Signal Processing\n                  {ICASSP} 2023, Rhodes Island, Greece, June 4-10, 2023},\n  pages        = {1--5},\n  publisher    = {{IEEE}},\n  year         = {2023},\n  url          = {https://doi.org/10.1109/ICASSP49357.2023.10094704},\n  doi          = {10.1109/ICASSP49357.2023.10094704},\n  timestamp    = {Mon, 05 Feb 2024 20:28:12 +0100},\n  biburl       = {https://dblp.org/rec/conf/icassp/DingZD23.bib},\n  bibsource    = {dblp computer science bibliography, https://dblp.org}\n}",
    "authors": [
        "Siwen Ding",
        "You Zhang",
        "Zhiyao Duan"
    ],
    "pdf_url": "https://doi.org/10.1109/ICASSP49357.2023.10094704",
    "pdf_path": "data/dataset/airqa/papers/icassp2023/7bc08302-bd44-5dfa-9e04-d6c4d8ce8b06.pdf",
    "num_pages": 5,
    "abstract": "Voice anti-spoofing systems are crucial auxiliaries for automatic speaker verification (ASV) systems. A major challenge is caused by unseen attacks empowered by advanced speech synthesis technologies. Our previous research on one-class learning has improved the generalization ability to unseen attacks by compacting the bona fide speech in the embedding space. However, such compactness lacks consideration of the diversity of speakers. In this work, we propose speaker attractor multi-center one-class learning (SAMO), which clusters bona fide speech around a number of speaker attractors and pushes away spoofing attacks from all the attractors in a high-dimensional embedding space. For training, we propose an algorithm for the co-optimization of bona fide speech clustering and bona fide/spoof classification. For inference, we propose strategies to enable anti-spoofing for speakers without enrollment. Our proposed system outperforms existing state-of-the-art single systems with a relative improvement of 38% on equal error rate (EER) on the ASVspoof2019 LA evaluation set.",
    "tldr": "SAMO improves voice anti-spoofing by clustering bona fide speech for better detection.",
    "tags": [
        "voice anti-spoofing",
        "one-class learning",
        "speaker verification",
        "clustering",
        "machine learning"
    ]
}