{
    "uuid": "8967d40f-af4b-5754-848a-0d84d923e39d",
    "title": "Gorilla: Large Language Model Connected with Massive APIs",
    "conference_full": "Conference on Neural Information Processing Systems",
    "conference": "NeurIPS",
    "year": 2024,
    "volume": "NeurIPS 2024 poster",
    "bibtex": "@inproceedings{\npatil2024gorilla,\ntitle={Gorilla: Large Language Model Connected with Massive {API}s},\nauthor={Shishir G Patil and Tianjun Zhang and Xin Wang and Joseph E. Gonzalez},\nbooktitle={The Thirty-eighth Annual Conference on Neural Information Processing Systems},\nyear={2024},\nurl={https://openreview.net/forum?id=tBRNC6YemY}\n}",
    "authors": [
        "Shishir G Patil",
        "Tianjun Zhang",
        "Xin Wang",
        "Joseph E. Gonzalez"
    ],
    "pdf_url": "https://openreview.net/pdf/18a6a0d15f2abb68c940776e23e520a6e0894c93.pdf",
    "pdf_path": "data/dataset/airqa/papers/neurips2024/8967d40f-af4b-5754-848a-0d84d923e39d.pdf",
    "num_pages": 22,
    "abstract": "Large Language Models (LLMs) have seen an impressive wave of advances, with\nmodels now excelling in a variety of tasks, such as mathematical reasoning and\nprogram synthesis. However, their potential to effectively use tools via API calls\nremains unfulfilled. This is a challenging task even for today’s state-of-the-art\nLLMs such as GPT-4 largely due to their unawareness of what APIs are available\nand how to use them in a frequently updated tool set. We develop Gorilla, a\nfinetuned LLaMA model that surpasses the performance of GPT-4 on writing API\ncalls. Trained with the novel Retriever Aware Training (RAT), when combined\nwith a document retriever, Gorilla demonstrates a strong capability to adapt to\ntest-time document changes, allowing flexible user updates or version changes.\nIt also substantially mitigates the issue of hallucination, commonly encountered\nwhen prompting LLMs directly. To evaluate the model’s ability, we introduce\nAPIBench, a comprehensive dataset consisting of HuggingFace, TorchHub, and\nTensorHub APIs. The successful integration of the retrieval system with Gorilla\ndemonstrates the potential for LLMs to use tools more accurately, keep up with\nfrequently updated documentation, and consequently increase the reliability and\napplicability of their outputs. Gorilla’s code, model, data, and demo are available\nat: https://gorilla.cs.berkeley.edu",
    "tldr": "Teaching LLMs to use tools at scale with innvoations in finetuning (RAT) and a novel way to mesasure hallucination using AST.",
    "tags": [
        "LLM",
        "Tool Use",
        "APIs",
        "Function Calling"
    ]
}