{
    "uuid": "944cd92d-07b5-55fd-a43a-ec5febd55fd0",
    "title": "PsychoLex: Unveiling the Psychological Mind of Large Language Models",
    "conference_full": "The 2024 Conference on Empirical Methods in Natural Language Processing",
    "conference": "EMNLP",
    "year": 2024,
    "volume": "Proceedings of the 1st Workshop on NLP for Science (NLP4Science)",
    "bibtex": "@inproceedings{abbasi-etal-2024-psycholex,\n    title = \"{P}sycho{L}ex: Unveiling the Psychological Mind of Large Language Models\",\n    author = \"Abbasi, Mohammad Amin  and\n      Mirnezami, Farnaz Sadat  and\n      Naderi, Hassan\",\n    editor = \"Peled-Cohen, Lotem  and\n      Calderon, Nitay  and\n      Lissak, Shir  and\n      Reichart, Roi\",\n    booktitle = \"Proceedings of the 1st Workshop on NLP for Science (NLP4Science)\",\n    month = nov,\n    year = \"2024\",\n    address = \"Miami, FL, USA\",\n    publisher = \"Association for Computational Linguistics\",\n    url = \"https://aclanthology.org/2024.nlp4science-1.4/\",\n    doi = \"10.18653/v1/2024.nlp4science-1.4\",\n    pages = \"24--35\",\n    abstract = \"This paper explores the intersection of psychology and artificial intelligence through the development and evaluation of specialized Large Language Models (LLMs). We introduce PsychoLex , a suite of resources designed to enhance LLMs' proficiency in psychological tasks in both Persian and English. Key contributions include the PsychoLexQA dataset for instructional content and the PsychoLexEval dataset for rigorous evaluation of LLMs in complex psychological scenarios. Additionally, we present the PsychoLexLLaMA model, optimized specifically for psychological applications, demonstrating superior performance compared to general-purpose models. The findings underscore the potential of tailored LLMs for advancing psychological research and applications, while also highlighting areas for further refinement. This research offers a foundational step towards integrating LLMs into specialized psychological domains, with implications for future advancements in AI-driven psychological practice.\"\n}\n",
    "authors": [
        "Mohammad Amin Abbasi",
        "Farnaz Sadat Mirnezami",
        "Hassan Naderi"
    ],
    "pdf_url": "https://aclanthology.org/2024.nlp4science-1.4.pdf",
    "pdf_path": "data/dataset/airqa/papers/emnlp2024/944cd92d-07b5-55fd-a43a-ec5febd55fd0.pdf",
    "num_pages": 12,
    "abstract": "This paper explores the intersection of psychology and artificial intelligence through the development and evaluation of specialized Large Language Models (LLMs). We introduce PsychoLex , a suite of resources designed to enhance LLMs’ proficiency in psychological tasks in both Persian and English. Key contributions include the PsychoLexQA dataset for instructional content and the PsychoLexEval dataset for rigorous evaluation of LLMs in complex psychological scenarios. Additionally, we present the PsychoLexLLaMA model, optimized specifically for psychological applications, demonstrating superior performance compared to general-purpose models. The findings underscore the potential of tailored LLMs for advancing psychological research and applications, while also highlighting areas for further refinement. This research offers a foundational step towards integrating LLMs into specialized psychological domains, with implications for future advancements in AI-driven psychological practice.",
    "tldr": "PsychoLex enhances LLMs for psychology tasks, showcasing tailored model performance.",
    "tags": [
        "psychology",
        "large language models",
        "PsychoLex",
        "artificial intelligence",
        "dataset evaluation"
    ]
}