{
    "uuid": "b3453666-3af4-5617-a23e-b94eefbd38e9",
    "title": "Adaptive Budget Allocation for Parameter-Efficient Fine-Tuning",
    "conference_full": "International Conference on Learning Representations",
    "conference": "ICLR",
    "year": 2023,
    "volume": "ICLR 2023 poster",
    "bibtex": "@inproceedings{\nzhang2023adaptive,\ntitle={Adaptive Budget Allocation for Parameter-Efficient Fine-Tuning },\nauthor={Qingru Zhang and Minshuo Chen and Alexander Bukharin and Pengcheng He and Yu Cheng and Weizhu Chen and Tuo Zhao},\nbooktitle={The Eleventh International Conference on Learning Representations },\nyear={2023},\nurl={https://openreview.net/forum?id=lq62uWRJjiY}\n}",
    "authors": [
        "Qingru Zhang",
        "Minshuo Chen",
        "Alexander Bukharin",
        "Pengcheng He",
        "Yu Cheng",
        "Weizhu Chen",
        "Tuo Zhao"
    ],
    "pdf_url": "https://openreview.net/pdf/00a236907b21d7118010fb705f96b4a934acff26.pdf",
    "pdf_path": "data/dataset/airqa/papers/iclr2023/b3453666-3af4-5617-a23e-b94eefbd38e9.pdf",
    "num_pages": 17,
    "abstract": "Fine-tuning large pre-trained language models on downstream tasks has become an important paradigm in NLP. However, common practice fine-tunes all of the parameters in a pre-trained model, which becomes prohibitive when a large number of downstream tasks are present. Therefore, many fine-tuning methods are proposed to learn incremental updates of pre-trained weights in a parameter efficient way, e.g., low-rank increments. These methods often evenly distribute the budget of incremental updates across all pre-trained weight matrices, and overlook the varying importance of different weight parameters. As a consequence, the fine-tuning performance is suboptimal. To bridge this gap, we propose AdaLoRA, which adaptively allocates the parameter budget among weight matrices according to their importance score. In particular, AdaLoRA parameterizes the incremental updates in the form of singular value decomposition. Such a novel approach allows us to effectively prune the singular values of unimportant updates, which is essentially to reduce their parameter budget but circumvent intensive exact SVD computations. We conduct extensive experiments with several pre-trained models on natural language processing, question answering, and natural language generation to validate the effectiveness of AdaLoRA. Results demonstrate that AdaLoRA manifests notable improvement over baselines, especially in the low budget settings. Our code is publicly available at https://github.com/QingruZhang/AdaLoRA .",
    "tldr": "AdaLoRA optimizes fine-tuning by adaptively allocating parameter budgets based on importance.",
    "tags": [
        "Adaptive budget allocation",
        "Parameter-efficient fine-tuning",
        "Natural language processing"
    ]
}