{
    "uuid": "b40cd7d7-4547-5fef-94c8-9973e61893fe",
    "title": "High-Fidelity Audio Compression with Improved RVQGAN",
    "conference_full": "Conference on Neural Information Processing Systems",
    "conference": "NeurIPS",
    "year": 2023,
    "volume": "NeurIPS 2023 spotlight",
    "bibtex": "@inproceedings{\nkumar2023highfidelity,\ntitle={High-Fidelity Audio Compression with Improved {RVQGAN}},\nauthor={Rithesh Kumar and Prem Seetharaman and Alejandro Luebs and Ishaan Kumar and Kundan Kumar},\nbooktitle={Thirty-seventh Conference on Neural Information Processing Systems},\nyear={2023},\nurl={https://openreview.net/forum?id=qjnl1QUnFA}\n}",
    "authors": [
        "Rithesh Kumar",
        "Prem Seetharaman",
        "Alejandro Luebs",
        "Ishaan Kumar",
        "Kundan Kumar"
    ],
    "pdf_url": "https://openreview.net/pdf/816db6078fa12108762348dd137a90cca5ddd839.pdf",
    "pdf_path": "data/dataset/airqa/papers/neurips2023/b40cd7d7-4547-5fef-94c8-9973e61893fe.pdf",
    "num_pages": 14,
    "abstract": "Language models have been successfully used to model natural signals, such as images, speech, and music. A key component of these models is a high quality neural compression model that can compress high-dimensional natural signals into lower dimensional discrete tokens. To that end, we introduce a high-fidelity universal neural audio compression algorithm that achieves ~90x compression of 44.1 KHz audio into tokens at just 8kbps bandwidth. We achieve this by combining advances in high-fidelity audio generation with better vector quantization techniques from the image domain, along with improved adversarial and reconstruction losses. We compress all domains (speech, environment, music, etc.) with a single universal model, making it widely applicable to generative modeling of all audio. We compare with competing audio compression algorithms, and find our method outperforms them significantly. We provide thorough ablations for every design choice, as well as open-source code and trained model weights. We hope our work can lay the foundation for the next generation of high-fidelity audio modeling.",
    "tldr": "A method for neural audio compression that outperforms competing approaches in terms of audio quality, at much higher compression rates.",
    "tags": [
        "audio generation",
        "audio compression",
        "GAN",
        "audio",
        "speech"
    ]
}