{
    "uuid": "bf865303-7fd8-5e3d-a8ee-7ee54b04ed40",
    "title": "A Two-Model Approach for Humour Style Recognition",
    "conference_full": "The 2024 Conference on Empirical Methods in Natural Language Processing",
    "conference": "EMNLP",
    "year": 2024,
    "volume": "Proceedings of the 4th International Conference on Natural Language Processing for Digital Humanities",
    "bibtex": "@inproceedings{kenneth-etal-2024-two,\n    title = \"A Two-Model Approach for Humour Style Recognition\",\n    author = \"Kenneth, Mary Ogbuka  and\n      Khosmood, Foaad  and\n      Edalat, Abbas\",\n    editor = {H\\\"am\\\"al\\\"ainen, Mika  and\n      \\\"Ohman, Emily  and\n      Miyagawa, So  and\n      Alnajjar, Khalid  and\n      Bizzoni, Yuri},\n    booktitle = \"Proceedings of the 4th International Conference on Natural Language Processing for Digital Humanities\",\n    month = nov,\n    year = \"2024\",\n    address = \"Miami, USA\",\n    publisher = \"Association for Computational Linguistics\",\n    url = \"https://aclanthology.org/2024.nlp4dh-1.25/\",\n    doi = \"10.18653/v1/2024.nlp4dh-1.25\",\n    pages = \"259--274\",\n    abstract = \"Humour, a fundamental aspect of human communication, manifests itself in various styles that significantly impact social interactions and mental health. Recognising different humour styles poses challenges due to the lack of established datasets and machine learning (ML) models. To address this gap, we present a new text dataset for humour style recognition, comprising 1463 instances across four styles (self-enhancing, self-deprecating, affiliative, and aggressive) and non-humorous text, with lengths ranging from 4 to 229 words. Our research employs various computational methods, including classic machine learning classifiers, text embedding models, and DistilBERT, to establish baseline performance. Additionally, we propose a two-model approach to enhance humour style recognition, particularly in distinguishing between affiliative and aggressive styles. Our method demonstrates an 11.61\\% improvement in f1-score for affiliative humour classification, with consistent improvements in the 14 models tested. Our findings contribute to the computational analysis of humour in text, offering new tools for studying humour in literature, social media, and other textual sources.\"\n}\n",
    "authors": [
        "Mary Ogbuka Kenneth",
        "Foaad Khosmood",
        "Abbas Edalat"
    ],
    "pdf_url": "https://aclanthology.org/2024.nlp4dh-1.25.pdf",
    "pdf_path": "data/dataset/airqa/papers/emnlp2024/bf865303-7fd8-5e3d-a8ee-7ee54b04ed40.pdf",
    "num_pages": 16,
    "abstract": "Humour, a fundamental aspect of human communication, manifests itself in various styles that significantly impact social interactions and mental health. Recognising different humour styles poses challenges due to the lack of established datasets and machine learning (ML) models. To address this gap, we present a new text dataset for humour style recognition, comprising 1463 instances across four styles (self-enhancing, self-deprecating, affiliative, and aggressive) and non-humorous text, with lengths ranging from 4 to 229 words. Our research employs various computational methods, including classic machine learning classifiers, text embedding models, and DistilBERT, to establish baseline performance. Additionally, we propose a two-model approach to enhance humour style recognition, particularly in distinguishing between affiliative and aggressive styles. Our method demonstrates an 11.61% improvement in f1-score for affiliative humour classification, with consistent improvements in the 14 models tested. Our findings contribute to the computational analysis of humour in text, offering new tools for studying humour in literature, social media, and other textual sources.",
    "tldr": "Proposes a two-model approach for improved humour style recognition in text.",
    "tags": [
        "humour recognition",
        "machine learning",
        "text classification",
        "humour styles",
        "DistilBERT"
    ]
}