{
    "uuid": "c302a979-c9a6-509a-a555-5fc9e5bb7bf8",
    "title": "Are Emergent Abilities of Large Language Models a Mirage?",
    "conference_full": "Conference on Neural Information Processing Systems",
    "conference": "NeurIPS",
    "year": 2023,
    "volume": "NeurIPS 2023 oral",
    "bibtex": "@inproceedings{\nschaeffer2023are,\ntitle={Are Emergent Abilities of Large Language Models a Mirage?},\nauthor={Rylan Schaeffer and Brando Miranda and Sanmi Koyejo},\nbooktitle={Thirty-seventh Conference on Neural Information Processing Systems},\nyear={2023},\nurl={https://openreview.net/forum?id=ITw9edRDlD}\n}",
    "authors": [
        "Rylan Schaeffer",
        "Brando Miranda",
        "Sanmi Koyejo"
    ],
    "pdf_url": "https://openreview.net/pdf/a1d4bae597f26697edc2580f69f44a6ce45a6c98.pdf",
    "pdf_path": "data/dataset/airqa/papers/neurips2023/c302a979-c9a6-509a-a555-5fc9e5bb7bf8.pdf",
    "num_pages": 17,
    "abstract": "Recent work claims that large language models display \\textit{emergent abilities}, abilities not present in smaller-scale models that are present in larger-scale models.\nWhat makes emergent abilities intriguing is two-fold: their \\textit{sharpness}, transitioning seemingly instantaneously from not present to present, and their \\textit{unpredictability}, appearing at seemingly unforeseeable model scales.\nHere, we present an alternative explanation for emergent abilities: that for a particular task and model family, when analyzing fixed model outputs, emergent abilities appear due the researcher’s choice of metric rather than due to fundamental changes in model behavior with scale. Specifically, nonlinear or discontinuous metrics produce apparent emergent abilities, whereas linear or continuous metrics produce smooth, continuous, predictable changes in model performance.\nWe present our alternative explanation in a simple mathematical model, then test it in three complementary ways: we (1) make, test and confirm three predictions on the effect of metric choice using the InstructGPT/GPT-3 family on tasks with claimed emergent abilities, (2) make, test and confirm two predictions about metric choices in a meta-analysis of emergent abilities on BIG-Bench; and (3) show how to choose metrics to produce never-before-seen seemingly emergent abilities in multiple vision tasks across diverse deep networks.\nVia all three analyses, we provide evidence that alleged emergent abilities evaporate with different metrics or with better statistics, and may not be a fundamental property of scaling AI models.",
    "tldr": "Some have argued that some improvements in model capabilities are unpredictable; we argue that many claimed emergent capabilities are predictable, either using better statistics or alternative metrics",
    "tags": [
        "large language models",
        "foundation models",
        "natural language processing",
        "language modeling",
        "emergent abilities"
    ]
}