{
    "uuid": "c846c33e-7401-50c6-a2a4-973ba293dff8",
    "title": "Adaptive deep spiking neural network with global-local learning via balanced excitatory and inhibitory mechanism",
    "conference_full": "International Conference on Learning Representations",
    "conference": "ICLR",
    "year": 2024,
    "volume": "ICLR 2024 poster",
    "bibtex": "@inproceedings{\njiang2024adaptive,\ntitle={Adaptive deep spiking neural network with global-local learning via balanced excitatory and inhibitory mechanism},\nauthor={Tingting Jiang and Qi Xu and Xuming Ran and Jiangrong Shen and Pan Lv and Qiang Zhang and Gang Pan},\nbooktitle={The Twelfth International Conference on Learning Representations},\nyear={2024},\nurl={https://openreview.net/forum?id=wpnlc2ONu0}\n}",
    "authors": [
        "Tingting Jiang",
        "Qi Xu",
        "Xuming Ran",
        "Jiangrong Shen",
        "Pan Lv",
        "Qiang Zhang",
        "Gang Pan"
    ],
    "pdf_url": "https://openreview.net/pdf/c5b667eeab004e67b805d67a029a04ee48ce9a4e.pdf",
    "pdf_path": "data/dataset/airqa/papers/iclr2024/c846c33e-7401-50c6-a2a4-973ba293dff8.pdf",
    "num_pages": 12,
    "abstract": "The training method of Spiking Neural Networks (SNNs) is an essential problem, and how to integrate local and global learning is a worthy research interest. However, the current integration methods do not consider the network conditions suitable for local and global learning, and thus fail to balance their advantages. In this paper, we propose an Excitation-Inhibition Mechanism-assisted Hybrid Learning(EIHL) algorithm that adjusts the network connectivity by using the excitation-inhibition mechanism and then switches between local and global learning according to the network connectivity. The experimental results on CIFAR10/100 and DVS-CIFAR10 demonstrate that the EIHL not only has better accuracy performance than other methods but also has excellent sparsity advantage. Especially, the Spiking VGG11 is trained by EIHL, STBP, and STDP on DVS_CIFAR10, respectively. The accuracy of the Spiking VGG11 model on EIHL is 62.45%, which is 4.35% higher than STBP and 11.40% higher than STDP, and the sparsity is 18.74%, which is 18.74% higher than the other two methods. Moreover, the excitation-inhibition mechanism used in our method also offers a new perspective on the field of SNN learning.",
    "tldr": "Inspired by the excitation-inhibition mechanism, we balance global and local learning by network connectivity to achieve both high accuracy and low energy consumption.",
    "tags": [
        "Spiking neural networks",
        "excitation inhibition mechanism",
        "Long-Term Potentiation",
        "Long-Term Depression"
    ]
}