{
    "uuid": "d7638fd4-69e4-5959-b0f5-84a4d53b1e3a",
    "title": "Crafting Personalized Agents through Retrieval-Augmented Generation on Editable Memory Graphs",
    "conference_full": "The 2024 Conference on Empirical Methods in Natural Language Processing",
    "conference": "EMNLP",
    "year": 2024,
    "volume": "Proceedings of the 2024 Conference on Empirical Methods in Natural Language Processing",
    "bibtex": "@inproceedings{wang-etal-2024-crafting,\n    title = \"Crafting Personalized Agents through Retrieval-Augmented Generation on Editable Memory Graphs\",\n    author = \"Wang, Zheng  and\n      Li, Zhongyang  and\n      Jiang, Zeren  and\n      Tu, Dandan  and\n      Shi, Wei\",\n    editor = \"Al-Onaizan, Yaser  and\n      Bansal, Mohit  and\n      Chen, Yun-Nung\",\n    booktitle = \"Proceedings of the 2024 Conference on Empirical Methods in Natural Language Processing\",\n    month = nov,\n    year = \"2024\",\n    address = \"Miami, Florida, USA\",\n    publisher = \"Association for Computational Linguistics\",\n    url = \"https://aclanthology.org/2024.emnlp-main.281\",\n    doi = \"10.18653/v1/2024.emnlp-main.281\",\n    pages = \"4891--4906\",\n    abstract = \"In the age of mobile internet, user data, often referred to as memories, is continuously generated on personal devices. Effectively managing and utilizing this data to deliver services to users is a compelling research topic. In this paper, we introduce a novel task of crafting personalized agents powered by large language models (LLMs), which utilize a user{'}s smartphone memories to enhance downstream applications with advanced LLM capabilities. To achieve this goal, we introduce EMG-RAG, a solution that combines Retrieval-Augmented Generation (RAG) techniques with an Editable Memory Graph (EMG). This approach is further optimized using Reinforcement Learning to address three distinct challenges: data collection, editability, and selectability. Extensive experiments on a real-world dataset validate the effectiveness of EMG-RAG, achieving an improvement of approximately 10{\\%} over the best existing approach. Additionally, the personalized agents have been transferred into a real smartphone AI assistant, which leads to enhanced usability.\",\n}\n",
    "authors": [
        "Zheng Wang",
        "Zhongyang Li",
        "Zeren Jiang",
        "Dandan Tu",
        "Wei Shi"
    ],
    "pdf_url": "https://aclanthology.org/2024.emnlp-main.281.pdf",
    "pdf_path": "data/dataset/airqa/papers/emnlp2024/d7638fd4-69e4-5959-b0f5-84a4d53b1e3a.pdf",
    "num_pages": 16,
    "abstract": "In the age of mobile internet, user data, often referred to as memories, is continuously generated on personal devices. Effectively managing and utilizing this data to deliver services to users is a compelling research topic. In this paper, we introduce a novel task of crafting personalized agents powered by large language models (LLMs), which utilize a user’s smartphone memories to enhance downstream applications with advanced LLM capabilities. To achieve this goal, we introduce EMG-RAG, a solution that combines Retrieval-Augmented Generation (RAG) techniques with an Editable Memory Graph (EMG). This approach is further optimized using Reinforcement Learning to address three distinct challenges: data collection, editability, and selectability. Extensive experiments on a real-world dataset validate the effectiveness of EMG-RAG, achieving an improvement of approximately 10% over the best existing approach. Additionally, the personalized agents have been transferred into a real smartphone AI assistant, which leads to enhanced usability.",
    "tldr": "Novel personalized agents using EMG-RAG enhance LLMs with user memories.",
    "tags": [
        "Personalized Agents",
        "Retrieval-Augmented Generation",
        "Editable Memory Graphs",
        "Large Language Models",
        "Reinforcement Learning"
    ]
}