{
    "uuid": "e6260126-455c-5dea-ac6d-b1c0e38c210d",
    "title": "TrojText: Test-time Invisible Textual Trojan Insertion",
    "conference_full": "International Conference on Learning Representations",
    "conference": "ICLR",
    "year": 2023,
    "volume": "ICLR 2023 poster",
    "bibtex": "@inproceedings{\nlou2023trojtext,\ntitle={TrojText: Test-time Invisible Textual Trojan Insertion},\nauthor={Qian Lou and Yepeng Liu and Bo Feng},\nbooktitle={The Eleventh International Conference on Learning Representations },\nyear={2023},\nurl={https://openreview.net/forum?id=ja4Lpp5mqc2}\n}",
    "authors": [
        "Qian Lou",
        "Yepeng Liu",
        "Bo Feng"
    ],
    "pdf_url": "https://openreview.net/pdf/090c1fa0cc728fa6eb032fe3c74b8b5125be7e94.pdf",
    "pdf_path": "data/dataset/airqa/papers/iclr2023/e6260126-455c-5dea-ac6d-b1c0e38c210d.pdf",
    "num_pages": 12,
    "abstract": "In Natural Language Processing (NLP), intelligent neuron models can be susceptible to textual Trojan attacks. Such attacks occur when Trojan models behave normally for standard inputs but generate malicious output for inputs that contain a specific trigger. Syntactic-structure triggers, which are invisible, are becoming more popular for Trojan attacks because they are difficult to detect and defend against. However, these types of attacks require a large corpus of training data to generate poisoned samples with the necessary syntactic structures for Trojan insertion. Obtaining such data can be difficult for attackers, and the process of generating syntactic poisoned triggers and inserting Trojans can be time-consuming. This paper proposes a solution called TrojText, which aims to determine whether invisible textual Trojan attacks can be performed more efficiently and cost-effectively without training data. The proposed approach, called the Representation-Logit Trojan Insertion (RLI) algorithm, uses smaller sampled test data instead of large training data to achieve the desired attack. The paper also introduces two additional techniques, namely the accumulated gradient ranking (AGR) and Trojan Weights Pruning (TWP), to reduce the number of tuned parameters and the attack overhead. The TrojText approach was evaluated on three datasets (AG’s News, SST-2, and OLID) using three NLP models (BERT, XLNet, and DeBERTa). The experiments demonstrated that the TrojText approach achieved a 98.35% classification accuracy for test sentences in the target class on the BERT model for the AG’s News dataset. The source code for TrojText is available at https://github.com/UCF-ML-Research/TrojText.",
    "tldr": "TrojText enables efficient invisible textual Trojan attacks without extensive training data.",
    "tags": [
        "Textual",
        "Trojan",
        "Backdoor",
        "Syntactic",
        "Trigger",
        "Invisible",
        "Attack",
        "Defense",
        "Test-time"
    ]
}