{
    "uuid": "ff860bc6-9474-58c9-8a5b-19d92fff2932",
    "title": "Massively Multilingual Corpus of Sentiment Datasets and Multi-faceted Sentiment Classification Benchmark",
    "conference_full": "Conference on Neural Information Processing Systems",
    "conference": "NeurIPS",
    "year": 2023,
    "volume": "NeurIPS 2023 Datasets and Benchmarks Poster",
    "bibtex": "@inproceedings{\naugustyniak2023massively,\ntitle={Massively Multilingual Corpus of Sentiment Datasets and Multi-faceted Sentiment Classification Benchmark},\nauthor={Lukasz Augustyniak and Szymon Wo{\\'z}niak and Marcin Gruza and Piotr Gramacki and Krzysztof Rajda and Miko{\\l}aj Morzy and Tomasz Jan Kajdanowicz},\nbooktitle={Thirty-seventh Conference on Neural Information Processing Systems Datasets and Benchmarks Track},\nyear={2023},\nurl={https://openreview.net/forum?id=7tMgzSvopH}\n}",
    "authors": [
        "Lukasz Augustyniak",
        "Szymon Woźniak",
        "Marcin Gruza",
        "Piotr Gramacki",
        "Krzysztof Rajda",
        "Mikołaj Morzy",
        "Tomasz Jan Kajdanowicz"
    ],
    "pdf_url": "https://openreview.net/pdf/17d7d7386aa73ef75c23aeb276d806acad28b799.pdf",
    "pdf_path": "data/dataset/airqa/papers/neurips2023/ff860bc6-9474-58c9-8a5b-19d92fff2932.pdf",
    "num_pages": 25,
    "abstract": "Despite impressive advancements in multilingual corpora collection and model training, developing large-scale deployments of multilingual models still presents a significant challenge. This is particularly true for language tasks that are culture-dependent. One such example is the area of multilingual sentiment analysis, where affective markers can be subtle and deeply ensconced in culture.\n\nThis work presents the most extensive open massively multilingual corpus of datasets for training sentiment models. The corpus consists of 79 manually selected datasets from over 350 datasets reported in the scientific literature based on strict quality criteria. The corpus covers 27 languages representing 6 language families. Datasets can be queried using several linguistic and functional features. In addition, we present a multi-faceted sentiment classification benchmark summarizing hundreds of experiments conducted on different base models, training objectives, dataset collections, and fine-tuning strategies.",
    "tldr": "The largest corpus of multi-lingual datasets for sentiment classification and a multi-faceted benchmark of models (pre-trained vs fine-tuned, multi-lingual vs single-language) for sentiment classification.",
    "tags": [
        "sentiment analysis",
        "multilingual",
        "dataset",
        "benchmark",
        "nlp"
    ]
}